
  <details>
  <summary>terraform/container-instance - Terraform Plan Output (click to expand)</summary>
  
```
data.oci_secrets_secretbundle.AWS_SECRET_ACCESS_KEY_bundle: Reading...
data.oci_identity_compartment.parent: Reading...
data.oci_secrets_secretbundle.AWS_ACCESS_KEY_ID_bundle: Reading...
data.oci_identity_compartment.parent: Read complete after 0s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]
data.oci_identity_availability_domains.local_ads: Reading...
data.oci_identity_availability_domains.local_ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-2588219643]
data.oci_secrets_secretbundle.AWS_SECRET_ACCESS_KEY_bundle: Read complete after 0s [id=SecretsSecretbundleDataSource-3422015541]
data.oci_secrets_secretbundle.AWS_ACCESS_KEY_ID_bundle: Read complete after 0s [id=SecretsSecretbundleDataSource-1124376924]
oci_container_instances_container_instance.demo_container_instance: Refreshing state... [id=ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaa5zrc6kzmafrmehehgrlkrzu7rxgwtgzomvy5j423othq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # oci_container_instances_container_instance.demo_container_instance must be replaced
-/+ resource "oci_container_instances_container_instance" "demo_container_instance" {
      ~ container_count                      = 3 -> (known after apply)
      ~ defined_tags                         = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
          - "Oracle-Tags.CreatedOn" = "2024-07-15T15:21:18.301Z"
        } -> (known after apply)
      + fault_domain                         = (known after apply)
      ~ graceful_shutdown_timeout_in_seconds = "0" -> (known after apply)
      ~ id                                   = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaa5zrc6kzmafrmehehgrlkrzu7rxgwtgzomvy5j423othq" -> (known after apply)
      ~ lifecycle_details                    = "Active" -> (known after apply)
      ~ state                                = "ACTIVE" -> (known after apply)
      ~ system_tags                          = {} -> (known after apply)
      ~ time_created                         = "2024-07-15 15:21:19.183 +0000 UTC" -> (known after apply)
      ~ time_updated                         = "2024-07-15 15:22:25.722 +0000 UTC" -> (known after apply)
      ~ volume_count                         = 0 -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ containers {
          ~ availability_domain            = "CwAQ:eu-amsterdam-1-AD-1" -> (known after apply)
          ~ command                        = [] -> (known after apply)
          ~ compartment_id                 = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q" -> (known after apply)
          ~ container_id                   = "ocid1.computecontainer.oc1.eu-amsterdam-1.anqw2ljr343laxaahu4nhtg4x4ok4o7yvg6rl7subvncxhf6ulskhmj3giiq" -> (known after apply)
          ~ container_instance_id          = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaa5zrc6kzmafrmehehgrlkrzu7rxgwtgzomvy5j423othq" -> (known after apply)
          ~ defined_tags                   = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T15:21:18.301Z"
            } -> (known after apply)
          ~ environment_variables          = { # forces replacement
              + "AWS_ACCESS_KEY_ID"     = "533ea348455845cc97b409aa67a25abd8cf503de"
              + "AWS_SECRET_ACCESS_KEY" = "sWNcL5trpHMAIBKF/8aPAN9RH6DL6bTuF3vJgpwlK9M="
            }
          ~ exit_code                      = 0 -> (known after apply)
          + fault_domain                   = (known after apply)
          ~ freeform_tags                  = {
              - "project-name" = "scylladb"
            } -> (known after apply)
          ~ is_resource_principal_disabled = false -> (known after apply)
          ~ lifecycle_details              = "CONTAINER_RUNNING" -> (known after apply)
          ~ state                          = "ACTIVE" -> (known after apply)
          ~ system_tags                    = {} -> (known after apply)
          ~ time_created                   = "2024-07-15 15:21:18.999 +0000 UTC" -> (known after apply)
          + time_terminated                = (known after apply)
          ~ time_updated                   = "2024-07-15 15:22:25.768 +0000 UTC" -> (known after apply)
          + working_directory              = (known after apply)
            # (3 unchanged attributes hidden)

          ~ resource_config {
              + memory_limit_in_gbs = (known after apply)
              + vcpus_limit         = (known after apply)
            }

          - security_context {
              - is_non_root_user_check_enabled = false -> null
              - is_root_file_system_readonly   = false -> null
              - run_as_group                   = 0 -> null
              - run_as_user                    = 0 -> null
              - security_context_type          = "LINUX" -> null
            }
        }
      ~ containers {
          ~ availability_domain            = "CwAQ:eu-amsterdam-1-AD-1" -> (known after apply)
          ~ compartment_id                 = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q" -> (known after apply)
          ~ container_id                   = "ocid1.computecontainer.oc1.eu-amsterdam-1.anqw2ljr343laxaajcjjdmvoyhzyoaypvuzumjwpxznmle3xzkbg7iav6ntq" -> (known after apply)
          ~ container_instance_id          = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaa5zrc6kzmafrmehehgrlkrzu7rxgwtgzomvy5j423othq" -> (known after apply)
          ~ defined_tags                   = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T15:21:18.301Z"
            } -> (known after apply)
          ~ environment_variables          = { # forces replacement
              + "AWS_ACCESS_KEY_ID"     = "533ea348455845cc97b409aa67a25abd8cf503de"
              + "AWS_SECRET_ACCESS_KEY" = "sWNcL5trpHMAIBKF/8aPAN9RH6DL6bTuF3vJgpwlK9M="
            }
          ~ exit_code                      = 2 -> (known after apply)
          + fault_domain                   = (known after apply)
          ~ freeform_tags                  = {
              - "project-name" = "scylladb"
            } -> (known after apply)
          ~ is_resource_principal_disabled = false -> (known after apply)
          ~ lifecycle_details              = "CONTAINER_TERMINATED" -> (known after apply)
          ~ state                          = "ACTIVE" -> (known after apply)
          ~ system_tags                    = {} -> (known after apply)
          ~ time_created                   = "2024-07-15 15:21:19.075 +0000 UTC" -> (known after apply)
          + time_terminated                = (known after apply)
          ~ time_updated                   = "2024-07-15 15:22:25.759 +0000 UTC" -> (known after apply)
          + working_directory              = (known after apply)
            # (4 unchanged attributes hidden)

          ~ resource_config {
              + memory_limit_in_gbs = (known after apply)
              + vcpus_limit         = (known after apply)
            }

          - security_context {
              - is_non_root_user_check_enabled = false -> null
              - is_root_file_system_readonly   = false -> null
              - run_as_group                   = 0 -> null
              - run_as_user                    = 0 -> null
              - security_context_type          = "LINUX" -> null
            }
        }
      ~ containers {
          ~ availability_domain            = "CwAQ:eu-amsterdam-1-AD-1" -> (known after apply)
          ~ compartment_id                 = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q" -> (known after apply)
          ~ container_id                   = "ocid1.computecontainer.oc1.eu-amsterdam-1.anqw2ljr343laxaabsxtbocrepkcpn2yvgdwcmqpm6ewz62qoxmfljnowv7a" -> (known after apply)
          ~ container_instance_id          = "ocid1.computecontainerinstance.oc1.eu-amsterdam-1.anqw2ljr343laxaa5zrc6kzmafrmehehgrlkrzu7rxgwtgzomvy5j423othq" -> (known after apply)
          ~ defined_tags                   = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T15:21:18.301Z"
            } -> (known after apply)
          ~ environment_variables          = { # forces replacement
              + "AWS_ACCESS_KEY_ID"     = "533ea348455845cc97b409aa67a25abd8cf503de"
              + "AWS_SECRET_ACCESS_KEY" = "sWNcL5trpHMAIBKF/8aPAN9RH6DL6bTuF3vJgpwlK9M="
            }
          ~ exit_code                      = 253 -> (known after apply)
          + fault_domain                   = (known after apply)
          ~ freeform_tags                  = {
              - "project-name" = "scylladb"
            } -> (known after apply)
          ~ is_resource_principal_disabled = false -> (known after apply)
          ~ lifecycle_details              = "CONTAINER_TERMINATED" -> (known after apply)
          ~ state                          = "ACTIVE" -> (known after apply)
          ~ system_tags                    = {} -> (known after apply)
          ~ time_created                   = "2024-07-15 15:21:19.156 +0000 UTC" -> (known after apply)
          + time_terminated                = (known after apply)
          ~ time_updated                   = "2024-07-15 15:22:25.751 +0000 UTC" -> (known after apply)
          + working_directory              = (known after apply)
            # (4 unchanged attributes hidden)

          ~ resource_config {
              + memory_limit_in_gbs = (known after apply)
              + vcpus_limit         = (known after apply)
            }

          - security_context {
              - is_non_root_user_check_enabled = false -> null
              - is_root_file_system_readonly   = false -> null
              - run_as_group                   = 0 -> null
              - run_as_user                    = 0 -> null
              - security_context_type          = "LINUX" -> null
            }
        }

      ~ shape_config {
          ~ networking_bandwidth_in_gbps = 1000 -> (known after apply)
          ~ processor_description        = "3.0 GHz Ampere® Altra™" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ vnics {
          ~ defined_tags           = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/bence.bano@crayon.com"
              - "Oracle-Tags.CreatedOn" = "2024-07-15T15:21:27.543Z"
            } -> (known after apply)
          ~ freeform_tags          = {} -> (known after apply)
          ~ nsg_ids                = [] -> (known after apply)
          ~ vnic_id                = "ocid1.vnic.oc1.eu-amsterdam-1.abqw2ljr37sg2icusabl7zjwheffsrxas22z6xixxggs3rixukplogpwgunq" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
